In [2]:
import pandas as pd
import numpy as np

In [3]:
customers = pd.read_csv('../data/raw/customers.csv')
customers

   customer_id  gender  age           province signup_date
0        C0001    Male   46           Chonburi  2023-12-29
1        C0002    Male   26  Nakhon Ratchasima  2023-11-02
2        C0003    Male   43             Phuket  2021-10-07
3        C0004    Male   20         Chiang Mai  2023-08-30
4        C0005  Female   46           Chonburi  2021-05-23
..         ...     ...  ...                ...         ...
95       C0096    Male   37          Khon Kaen  2023-05-23
96       C0097  Female   37         Chiang Mai  2023-03-07
97       C0098    Male   25  Nakhon Ratchasima  2022-02-24
98       C0099  Female   45  Nakhon Ratchasima  2023-11-13
99       C0100    Male   24            Bangkok  2021-06-29

[100 rows x 5 columns]

In [4]:
customer_head = customers.head()
customer_head

  customer_id  gender  age           province signup_date
0       C0001    Male   46           Chonburi  2023-12-29
1       C0002    Male   26  Nakhon Ratchasima  2023-11-02
2       C0003    Male   43             Phuket  2021-10-07
3       C0004    Male   20         Chiang Mai  2023-08-30
4       C0005  Female   46           Chonburi  2021-05-23

In [5]:
customer_tail = customers.tail()
customer_tail

   customer_id  gender  age           province signup_date
95       C0096    Male   37          Khon Kaen  2023-05-23
96       C0097  Female   37         Chiang Mai  2023-03-07
97       C0098    Male   25  Nakhon Ratchasima  2022-02-24
98       C0099  Female   45  Nakhon Ratchasima  2023-11-13
99       C0100    Male   24            Bangkok  2021-06-29

In [6]:
customers.shape

(100, 5)

In [7]:
print(customers.dtypes)

customer_id    object
gender         object
age             int64
province       object
signup_date    object
dtype: object

In [8]:
customers['signup_date'] = pd.to_datetime(customers['signup_date'])
print(customers.dtypes)

customer_id            object
gender                 object
age                     int64
province               object
signup_date    datetime64[ns]
dtype: object

In [9]:
customers.isnull().sum()

customer_id    0
gender         0
age            0
province       0
signup_date    0
dtype: int64

In [10]:
customers.isna().sum()

customer_id    0
gender         0
age            0
province       0
signup_date    0
dtype: int64

In [11]:
customers.describe()

              age          signup_date
count  100.000000                  100
mean    32.830000  2022-08-29 03:07:12
min     18.000000  2021-01-16 00:00:00
25%     24.750000  2022-01-11 18:00:00
50%     34.500000  2022-10-02 00:00:00
75%     40.250000  2023-05-24 06:00:00
max     50.000000  2023-12-29 00:00:00
std      9.498596                  NaN